app/controllers/alunos_controller.rb

SELECT "alunos".* FROM "alunos"
---
  def index
    @alunos = Aluno.all

INSERT INTO "alunos" ("nome", "idade", "cpf", "telefone", "email", "data_nascimento", "endereco", "observacao", "status", "created_at", "updated_at") VALUES ('Guilherme Santo Costa', 20, '58263945711', '99996497198', 'guizao@gmail.com', '2004-12-21', 'Avenida Adolfo John terry', 'Alergico a banana', TRUE, '2024-12-20 05:03:19.902919', '2024-12-20 05:03:19.902919') RETURNING "id"
---
  def create
    @aluno = Aluno.new(aluno_params)

    respond_to do |format|
      if @aluno.save

SELECT "alunos".* FROM "alunos" WHERE "alunos"."id" = 1 LIMIT 1
---
    def set_aluno
      @aluno = Aluno.find(params.expect(:id))